plcengineer/m3_arduino/package/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

# Arndt M3 (Native USB Port)
# ---------------------------------------
arduino_arndt_m3_a.name=Arndt M3/Rev. A (USB Port)
arduino_arndt_m3_a.vid.0=0x2341
arduino_arndt_m3_a.pid.0=0x804d
arduino_arndt_m3_a.vid.1=0x2341
arduino_arndt_m3_a.pid.1=0x004d

arduino_arndt_m3_a.vid.2=0x2341
arduino_arndt_m3_a.pid.2=0x824d
# If the board is a 2341:824d use 2341:824d for build and set other parameters as well
arduino_arndt_m3_a.vid.2.build.vid=0x2341
arduino_arndt_m3_a.vid.2.build.pid=0x824d
arduino_arndt_m3_a.vid.2.build.usb_product="Genuino Zero"
arduino_arndt_m3_a.vid.2.bootloader.file=zero/samd21_sam_ba_genuino.bin

arduino_arndt_m3_a.vid.3=0x2341
arduino_arndt_m3_a.pid.3=0x024d
# If the board is a 2341:024d use 2341:824d for build and set other parameters as well
arduino_arndt_m3_a.vid.3.build.vid=0x2341
arduino_arndt_m3_a.vid.3.build.pid=0x824d
arduino_arndt_m3_a.vid.3.build.usb_product="Genuino Zero"
arduino_arndt_m3_a.vid.3.bootloader.file=zero/samd21_sam_ba_genuino.bin

arduino_arndt_m3_a.upload.tool=bossac
arduino_arndt_m3_a.upload.protocol=sam-ba
arduino_arndt_m3_a.upload.maximum_size=262144
arduino_arndt_m3_a.upload.use_1200bps_touch=true
arduino_arndt_m3_a.upload.wait_for_upload_port=true
arduino_arndt_m3_a.upload.native_usb=true
arduino_arndt_m3_a.build.mcu=cortex-m0plus
arduino_arndt_m3_a.build.f_cpu=48000000L
arduino_arndt_m3_a.build.usb_product="Arduino Zero"
arduino_arndt_m3_a.build.usb_manufacturer="Arduino LLC"
arduino_arndt_m3_a.build.board=SAMD_ZERO
arduino_arndt_m3_a.build.core=arduino
arduino_arndt_m3_a.build.extra_flags=-D__SAMD21E18A__ {build.usb_flags} -DUSBCON -D_UART485_
arduino_arndt_m3_a.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
arduino_arndt_m3_a.build.openocdscript=openocd_scripts/arduino_zero.cfg
arduino_arndt_m3_a.build.variant=arduino_zero
arduino_arndt_m3_a.build.variant_system_lib=
arduino_arndt_m3_a.build.vid=0x2341
arduino_arndt_m3_a.build.pid=0x804d
arduino_arndt_m3_a.bootloader.tool=openocd
arduino_arndt_m3_a.bootloader.file=zero/samd21_sam_ba.bin
